Emile666/Brew_HW_Stm8s207/brew_stm8s207.c
/*==================================================================
  File Name: brew_stm8s207.c
  Author   : Emile
  ------------------------------------------------------------------
  Purpose  : This is the main file for brew_stm8s207.c
  ------------------------------------------------------------------
  This file is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
 
  This software is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
 
  You should have received a copy of the GNU General Public License
  along with this software.  If not, see <http://www.gnu.org/licenses/>.
  ------------------------------------------------------------------
  Revision 2.04  2023/10/03 Emile
  - Revision history before rev. 2.00 removed
  - Code clean-up
  - 3 phase electric heating enabled
  - Delayed-start now set to 100%

  Revision 2.03  2023/10/02  Emile
  - MAX7219 PCB and Ethernet now work together 

  Revision 2.00  2021/03/31 12:20  Emile
  - Ported from Brew_Arduino rev. r1.39 for e-brew PCB v4.01 
  ================================================================== */ 
#include "brew_stm8s207.h"
#include "stm8_hw_init.h"
#include "w5500.h"
#include "Ethernet.h"
#include "Udp.h"
#include "one_wire.h"
#include "max7219.h"
      
extern char rs232_inbuf[];

// Global variables
uint8_t      local_ip[4]      = {0,0,0,0}; // local IP address, gets a value from init_WIZ550IO_module() -> dhcp_begin()
uint16_t     local_port;                   // local port number read back from wiz550i module
const char  *ebrew_revision   = "$Revision: 2.05 $"; // ebrew revision number
bool         ethernet_WIZ550i = true;		     // true = start WIZ550i at power-up

// The following variables are defined in Udp.c
extern uint8_t  remoteIP[4]; // remote IP address for the incoming packet whilst it's being processed 
extern uint16_t remotePort;  // remote port for the incoming packet whilst it's being processed 
extern uint8_t  _sock;       // socket ID for Wiz5100
unsigned char   udp_rcv_buf[UDP_TX_PACKET_MAX_SIZE]; // buffer to hold incoming packet]

// The following variables are needed for the buzzer
extern bool     bz_on;      // true = buzzer is enabled
extern uint8_t  bz_rpt_max; // number of beeps to make
extern uint8_t  bz_freq;    // Buzzer frequency

//-----------------------------------
// Electric Heating variables
//-----------------------------------
uint8_t  hlt_elec1_pwm = 0;       // PWM signal (0-100 %) for HLT Electric Heating 1
uint8_t  hlt_elec2_pwm = 0;       // PWM signal (0-100 %) for HLT Electric Heating 2
uint8_t  hlt_elec3_pwm = 0;       // PWM signal (0-100 %) for HLT Electric Heating 3
pwmtime  pwmhlt1;                 // Struct for HLT Electric Heater 1 Slow SSR signal
pwmtime  pwmhlt2;                 // Struct for HLT Electric Heater 2 Slow SSR signal
pwmtime  pwmhlt3;                 // Struct for HLT Electric Heater 3 Slow SSR signal
uint8_t  bk_elec1_pwm = 0;        // PWM signal (0-100 %) for Boil-kettle Electric Heating 1
uint8_t  bk_elec2_pwm = 0;        // PWM signal (0-100 %) for Boil-kettle Electric Heating 2
uint8_t  bk_elec3_pwm = 0;        // PWM signal (0-100 %) for Boil-kettle Electric Heating 3
pwmtime  pwmbk1;                  // Struct for Boil-kettle Electric Heater 1 Slow SSR signal
pwmtime  pwmbk2;                  // Struct for Boil-kettle Electric Heater 2 Slow SSR signal
pwmtime  pwmbk3;                  // Struct for Boil-kettle Electric Heater 3 Slow SSR signal
uint8_t  elec_htrs = 0x00;        // Bit-define for every electrical phase of HLT and BK

//-----------------------------------
// LM35 parameters and variables
//-----------------------------------
ma       lm35_ma;                   // struct for LM35 moving_average filter
uint16_t lm35_temp;                 // LM35 Temperature in E-2 °C

//------------------------------------------------
// THLT parameters and variables (I2C)
//------------------------------------------------
int16_t  temp_slope_87  = 512;      // Temperature slope-limiter is 4 °C/ 2 sec. * 128
ma       thlt_ma;                   // struct for THLT moving_average filter
int16_t  thlt_old_87;               // Previous value of thlt_temp_87
int16_t  thlt_temp_87;              // THLT Temperature from LM92 in °C * 128
uint8_t  thlt_err = 0;              // 1 = Read error from LM92

//-----------------------------------------------------
// THLT parameters and variables (One-Wire). Used for:
// 1) Backup for THLT-I2C
// 2) Can be used as extra temp. sensor
//-----------------------------------------------------
ma       thlt_ow_ma;                // struct for THLT_OW moving_average filter
int16_t  thlt_ow_old_87;            // Previous value of thlt_ow_87
int16_t  thlt_ow_87;                // THLT Temperature from DS18B20 in °C * 128
uint8_t  thlt_ow_err = 0;	    // 1 = Read error from DS18B20
 
//------------------------------------------------
// TMLT parameters and variables (I2C)
//------------------------------------------------
ma       tmlt_ma;                   // struct for TMLT moving_average filter
int16_t  tmlt_old_87;               // Previous value of tmlt_temp_87
int16_t  tmlt_temp_87;              // TMLT Temperature from LM92 in °C * 128
uint8_t  tmlt_err = 0;              // 1 = Read error from LM92

//-----------------------------------------------------
// TMLT parameters and variables (One-Wire). Used for:
// 1) Backup for TMLT-I2C
// 2) Can be used as extra temp. sensor
//-----------------------------------------------------
ma       tmlt_ow_ma;                // struct for TMLT_OW moving_average filter
int16_t  tmlt_ow_old_87;            // Previous value of tmlt_ow_87
int16_t  tmlt_ow_87;                // TMLT Temperature from DS18B20 in °C * 128
uint8_t  tmlt_ow_err = 0;	    // 1 = Read error from DS18B20

