Emile666/Brew_HW_Stm8s207/brew_stm8s207.c
//------------------------------------------------
// TCFC parameters and variables (One-Wire only)
//------------------------------------------------
ma       tcfc_ma;                   // struct for TCFC moving_average filter
int16_t  tcfc_old_87;               // Previous value of tcfc_temp_87
int16_t  tcfc_temp_87;              // TCFC Temperature in °C * 128
uint8_t  tcfc_err = 0;              // 1 = Read error from DS18B20  

//------------------------------------------------
// TBOIL parameters and variables (One-Wire only)
//------------------------------------------------
ma       tboil_ma;                  // struct for TBOIL moving_average filter
int16_t  tboil_old_87;              // Previous value of tboil_temp_87
int16_t  tboil_temp_87;             // TBOIL Temperature in °C * 128
uint8_t  tboil_err = 0;             // 1 = Read error from DS18B20

uint32_t flow_hlt_mlt  = 0UL; // Flow 1
uint32_t flow_mlt_boil = 0UL; // Flow 2
uint32_t flow_cfc_out  = 0UL; // Flow 3 Count from flow-sensor at output of CFC
uint32_t flow4         = 0UL; // Flow 4 Count from HLT-CFC to MLT-top return
uint32_t flow_old1     = 0UL;
uint32_t flow_old2     = 0UL;
uint32_t flow_old3     = 0UL;
uint32_t flow_old4     = 0UL;

//------------------------------------------------
// Delayed-start variables
//------------------------------------------------
bool     delayed_start_enable  = false;          // true = delayed start is enabled
uint16_t delayed_start_time    = 0;              // delayed start time in 2 sec. counts 
uint16_t delayed_start_timer1;                   // timer to countdown until delayed start
uint8_t  delayed_start_std     = DEL_START_INIT; // std number, start in INIT state

//------------------------------------------------
// Frontpanel LEDs are controlled by the MAX7219
//------------------------------------------------
uint8_t max7219dig2 = 0; // LEDs: Alive, Delayed-Start, Pump2, Pump1, F4, F3, F2, F1
uint8_t max7219dig0 = 0; // LEDs: HLT gas, HLT E3, HLT E2, HLT E1, BK gas, BK E3, BK E2, BK E1

/*------------------------------------------------------------------
  Purpose  : This is the delayed-start routine which is called by 
             lm35_task() every 2 seconds. 
  Variables: -
  Returns  : -
  ------------------------------------------------------------------*/
void process_delayed_start(void)
{
    uint8_t         led_tmr_max = 0; // blink every x seconds  
    static uint8_t  led_tmr     = 0; // Timer for blinking of RED led
    static uint16_t eep_tmr;         // minute counter for eeprom write
    static uint16_t timer2;          // timer for max. burn in minutes (max. 120 minutes)
    
    switch (delayed_start_std)
    {
        case DEL_START_INIT: // Delayed-start is not enabled
            if (delayed_start_enable)
            {
                delayed_start_timer1 = eep_read16(EEPARB_DEL_START_TMR1); // read value from eeprom
                delayed_start_time   = eep_read16(EEPARB_DEL_START_TIME); // read value from eeprom
                eep_tmr              = 0;                      // reset eeprom minute timer
                delayed_start_std    = DEL_START_TMR;          // start countdown timer
            } // if				 
            led_tmr_max = 0; // no blinking
            break;
            
        case DEL_START_TMR: // The delayed-start timer is running, no time-out yet
            if (!delayed_start_enable)
            {
                eep_write8(EEPARB_DEL_START_ENA,false); // reset enable in eeprom
                delayed_start_std = DEL_START_INIT;
            } // if				 
            else if (++delayed_start_timer1 >= delayed_start_time)
            {   // delayed-start counted down
                timer2            = 0;              // init. burn-timer 
                delayed_start_std = DEL_START_BURN; // start HLT burner
            } // if
            if (++eep_tmr >= 30)
            {   // save in eeprom every minute
                eep_tmr = 0;
                eep_write16(EEPARB_DEL_START_TMR1,delayed_start_timer1);
            } // if
            led_tmr_max = 5; // blink once every 10 seconds
            break;
            
        case DEL_START_BURN: // Delayed-start time-out, HLT-burner is burning
            if (!delayed_start_enable)
            {
                eep_write8(EEPARB_DEL_START_ENA,false); // reset enable in eeprom
                delayed_start_std = DEL_START_INIT;
                process_pwm_signal(PWM_HLT,0,ELEC_HTR1|ELEC_HTR2|ELEC_HTR3); // disable heaters
            } // if
            else 
            {	// For delayed start: only enable HLT electric heaters with fixed percentage	 
                process_pwm_signal(PWM_HLT,DEL_START_ELEC_PWM,ELEC_HTR1|ELEC_HTR2|ELEC_HTR3);
                if (++timer2 >= DEL_START_MAX_BURN_TIME) 
                {   // Safety feature, set burn-time to max. of 2 hours
                    delayed_start_enable = false; // prevent another burn
                    delayed_start_std    = DEL_START_INIT;
                    eep_write8(EEPARB_DEL_START_ENA,false); // reset enable in eeprom
                } // if
            } // else				 
            led_tmr_max = 1; // blink once every 4 seconds
            break;
            
        default: delayed_start_std = DEL_START_INIT;
        break;
    } // switch
    if ((led_tmr_max > 0) && (++led_tmr > led_tmr_max))
    {    // blink once every led_tmr_max seconds
        led_tmr      = 0;
        ALIVE_LED_Rb = 1; // red LED on
        max7219dig2 |= MAX7219D2DS; // Frontpanel LED on
    } // if
    else 
    {
        ALIVE_LED_Rb = 0; // red LED off
        max7219dig2 &= ~MAX7219D2DS; // Frontpanel LED off
    } // else
} // process_delayed_start()

/*------------------------------------------------------------------
  Purpose  : This function initializes the pwm_2_time structs that
             are used for the HLT electric heating-elements.
  Variables: 
          p: pointer to struct to initialize
	   mask: bit-defines of electric heaters in elec_htrs variable.
	  on1st: phase of PWM signal, true = 1 first, false = 0 first
  Returns  : -
  ------------------------------------------------------------------*/
void init_pwm_time(pwmtime *p, uint8_t mask, bool on1st)
{
	p->std    = EL_HTR_OFF; // default state
	p->mask   = mask;       // bit-define for elec_htrs
	p->on1st  = on1st;      // true = high first, then low
} // init_pwm_time()

/*-----------------------------------------------------------------------------
  Purpose  : Converts a PWM signal into a time-division signal of 100 * 100 msec.
             This is used to control the electric heating-elements.
             This routine should be called from pwm_task() every 100 msec.
	     It uses the pwm values which are set by process_pwm_signal().
  Variables: p: pointer to pwmtime struct. There is a separate struct for each
                electric heating-element.
	  cntr: time-division counter, counts from 1 to 100 and back again.
           pwm: PWM percentage.
  Returns  : -
  ---------------------------------------------------------------------------*/
void pwm_2_time(pwmtime *p, uint8_t cntr, uint8_t pwm)
{
	int8_t  bt,et;
	
	bt  = p->on1st ? 25 : 75; // time center-point
	bt -= (pwm>>1);           // start-time for a 1
	et  = bt + pwm;           // end-time for a 1
	if      (bt < 0)   { bt = 0        ; et = pwm; }
	else if (et > 100) { bt = 100 - pwm; et = 100; }

	switch (p->std)
	{
		case EL_HTR_OFF:
			//------------------------------------------------------------
			// Goto ON-state if cntr in [bt,et] && pwm>0
			//------------------------------------------------------------
			elec_htrs &= ~p->mask;
			if ((pwm > 0) && (cntr >= bt) && (cntr < et))
			{  
				p->std = EL_HTR_ON; // go to ON-state
			} // if
			// else: pwm=0 or outside 1-time, continue in this state
			break;

		case EL_HTR_ON:
			//---------------------------------------------------------
			// Goto OFF-state if pwm=0 or cntr>et && pwm<100
			//---------------------------------------------------------
			elec_htrs |= p->mask;       // set electric heater ON
			if ((pwm == 0) || ((cntr >= et) && (pwm < 100)))
			{   
				p->std = EL_HTR_OFF;   // go to 'OFF' state
			} // if
			// else: pwm>0 && ((cntr < et) || (pwm>=100))
			break;

		default: 
		    p->std = EL_HTR_OFF;
		    break;	
	} // switch 
} // pwm_2_time()

/*-----------------------------------------------------------------------------
  Purpose  : This task converts a PWM signal into a time-division signal of 
             100 * 100 msec. This routine should be called from the scheduler 
	     every 100 msec. It uses the hlt_elecx_pwm and bk_elecx_pwm signals 
	     which were set by the process_pwm_signal(). This variable will only 
	     get a non-zero number when the corresponding electrical 
	     heating-element is enabled.
			 
	     Priority: the HLT and BK heating-elements can be sourced from the
	     same outlet. If the BK starts to heat, it may be possible
	     for the HLT to draw current too. In order to prevent this,
	     the BK has priority over the HLT. In other words, if the
	     BK heating-element is energized, the HLT heating-element
	     on the same outlet is disabled.
  Variables: - 
  Returns  : -
  ---------------------------------------------------------------------------*/
void pwm_task(void)
{
   static uint8_t cntr = 1; // time-division counter
   
   pwm_2_time(&pwmbk1 ,cntr,bk_elec1_pwm);   // BK heating-element 1
   pwm_2_time(&pwmbk2 ,cntr,bk_elec2_pwm);   // BK heating-element 2
   pwm_2_time(&pwmbk3 ,cntr,bk_elec3_pwm);   // BK heating-element 3
   
   pwm_2_time(&pwmhlt1,cntr,hlt_elec1_pwm);  // HLT heating-element 1
   pwm_2_time(&pwmhlt2,cntr,hlt_elec2_pwm);  // HLT heating-element 2
   pwm_2_time(&pwmhlt3,cntr,hlt_elec3_pwm);  // HLT heating-element 3
   
   // If both heaters of the same phase are on, disable the HLT phase
   if ((elec_htrs & (HTR_BK1 | HTR_HLT1)) == (HTR_BK1 | HTR_HLT1)) elec_htrs &= ~HTR_HLT1;
   if ((elec_htrs & (HTR_BK2 | HTR_HLT2)) == (HTR_BK2 | HTR_HLT2)) elec_htrs &= ~HTR_HLT2;
   if ((elec_htrs & (HTR_BK3 | HTR_HLT3)) == (HTR_BK3 | HTR_HLT3)) elec_htrs &= ~HTR_HLT3;
   
