Emile666/Brew_HW_Stm8s207/brew_stm8s207.c
   if (elec_htrs & pwmhlt1.mask)
        { HLT_SSR1b = true;  max7219dig0 |=  MAX7219D0H1; } // Enable  HLT heater 1 
   else { HLT_SSR1b = false; max7219dig0 &= ~MAX7219D0H1; } // Disable HLT heater 1
   if (elec_htrs & pwmhlt2.mask)
        { HLT_SSR2b = true;  max7219dig0 |=  MAX7219D0H2; } // Enable  HLT heater 2
   else { HLT_SSR2b = false; max7219dig0 &= ~MAX7219D0H2; } // Disable HLT heater 2
   if (elec_htrs & pwmhlt3.mask)
        { HLT_SSR3b = true;  max7219dig0 |=  MAX7219D0H3; } // Enable  HLT heater 3
   else { HLT_SSR3b = false; max7219dig0 &= ~MAX7219D0H3; } // Disable HLT heater 3
   
   if (elec_htrs & pwmbk1.mask)
        { BK_SSR1b = true;  max7219dig0 |=  MAX7219D0B1; } // Enable  BK heater 1
   else { BK_SSR1b = false; max7219dig0 &= ~MAX7219D0B1; } // Disable BK heater 1
   if (elec_htrs & pwmbk2.mask)
        { BK_SSR2b = true;  max7219dig0 |=  MAX7219D0B2; } // Enable  BK heater 2
   else { BK_SSR2b = false; max7219dig0 &= ~MAX7219D0B2; } // Disable BK heater 2
   if (elec_htrs & pwmbk3.mask)
        { BK_SSR3b = true;  max7219dig0 |=  MAX7219D0B3; } // Enable  BK heater 3
   else { BK_SSR3b = false; max7219dig0 &= ~MAX7219D0B3; } // Disable BK heater 3

   // Update frontpanel LEDs
   if (flow_hlt_mlt != flow_old1)
   {
        max7219dig2 ^=  MAX7219D2F1; // toggle LED
        flow_old1 = flow_hlt_mlt;
   } // if
   else max7219dig2 &= ~MAX7219D2F1; // LED off
   if (flow_mlt_boil != flow_old2)
   {    
        max7219dig2 ^=  MAX7219D2F2; // toggle LED
        flow_old2 = flow_mlt_boil;
   } // if
   else max7219dig2 &= ~MAX7219D2F2; // LED off
   if (flow_cfc_out != flow_old3)
   {
        max7219dig2 ^=  MAX7219D2F3; // toggle LED
        flow_old3 = flow_cfc_out;
   } // if
   else max7219dig2 &= ~MAX7219D2F3; // LED off
   if (flow4 != flow_old4)
   {
        max7219dig2 ^=  MAX7219D2F4; // toggle LED
        flow_old4 = flow4;
   } // if
   else max7219dig2 &= ~MAX7219D2F4; // LED off
   max7219_write(MAX7219_DIG0 | max7219dig0);
   max7219_write(MAX7219_DIG2 | max7219dig2);
   
   if (++cntr > 100) cntr = 1; // reset time-division counter
} // pwm_task()

/*--------------------------------------------------------------------
   Purpose  : This task is called every 2 seconds and does the following:
             1) processes the temperature from the Hot-Liquid Tun (HLT). 
	        The first sensor to read is the LM92 (I2C sensor). If 
		that one is not present, the DS18B20 (One-Wire sensor) 
		is tried. It uses the output from ow_task(), which delivers
		a new DS18B20 reading every 2 seconds.
		Since both sensors have 4 fractional bits (1/2, 1/4, 1/8, 1/16), 
		a signed Q8.4 format would be sufficient. However all variables 
		are stored in a Q8.7 format for accuracy reasons when filtering. 
		All variables with this format have the extension _87. The 
		HLT temperature is both filtered and slope-limited.
	     2) processes the temperature from the LM35 temperature sensor. 
		This sensor is connected to ADC0. The LM35 outputs 10 mV/°C,
		VREF=1.1 V, therefore => Max. Temp. = 11000 E-2 °C
		Conversion constant = 11000 / 1023 = 10.7526882
             3) executes the delayed-start function, which will fire the
		HLT burner after a number of minutes set by the D0 command.

  Variables: thlt_old_87   : previous value of thlt_temp_87
             temp_slope_87 : the slope-limit: 2 °C/sec.
             thlt_err      : 1 = error reading from LM92 (I2C)
             thlt_ow_err   : 1 = error reading from DS18B20 (One-Wire)
             thlt_ow_87    : Temperature value from DS18B20 (One-Wire)
             thlt_ma       : the moving-average filter struct for THLT
             thlt_temp_87  : the processed HLT temperature in °C
             lm35_temp     : contains temperature in E-2 °C
             lm35_frac     : contains fractional temperature in E-2 °C
             lm35_ma       : moving-average filter struct for lm35_temp
  Returns  : -
  --------------------------------------------------------------------*/
void thlt_task(void)
{
    int16_t tmp;  // temporary variable (signed Q8.7 format)
    float   tmpf; // temporary variable
    
    thlt_old_87 = thlt_temp_87; // copy previous value of thlt_temp
    tmp         = lm92_read(I2C_CH1, &thlt_err); // returns a signed Q8.7 format
    if (!thlt_err) 
    {	// filter if I2C-sensor has been read successfully
        slope_limiter(temp_slope_87, thlt_old_87, &tmp);
        thlt_temp_87 = (int16_t)(moving_average(&thlt_ma, (float)tmp) + 0.5);
    } // if
    
    tmpf      = read_adc(AD_LM35) * LM35_CONV; // Read LM35 temperature sensor
    lm35_temp = (uint16_t)moving_average(&lm35_ma, tmpf);
    process_delayed_start();                   // Process delayed-start function
} // thlt_task()

/*--------------------------------------------------------------------
  Purpose  : This is the task that processes the temperature from
	     the Mash-Lauter Tun (MLT). The first sensor to read is the
	     LM92 (I2C sensor). If that one is not present, the DS18B20
	     (One-Wire sensor) is tried. Since both sensors have 4
	     fractional bits (1/2, 1/4, 1/8, 1/16), a signed Q8.4 format
	     would be sufficient. However all variables are stored in a
	     Q8.7 format for accuracy reasons when filtering. All variables
	     with this format have the extension _87.
	     The MLT temperature is both filtered and slope-limited.
	     This task is called every 2 seconds and uses the output from
	     ow_task(), which delivers a new DS18B20 reading every 2 seconds.
  Variables: tmlt_old_87   : previous value of tmlt_temp_87
	     temp_slope_87 : the slope-limit: 2 °C/sec.
	     tmlt_err      : 1 = error reading from LM92 (I2C)
	     tmlt_ow_err   : 1 = error reading from DS18B20 (One-Wire)
	     tmlt_ow_87    : Temperature value from DS18B20 (One-Wire)
	     tmlt_ma       : the moving-average filter struct for TMLT
	     tmlt_temp_87  : the processed MLT temperature in °C
  Returns  : -
  --------------------------------------------------------------------*/
void tmlt_task(void)
{
    int16_t tmp; // temporary variable (signed Q8.7 format)
    
    tmlt_old_87 = tmlt_temp_87; // copy previous value of tmlt_temp
    tmp         = lm92_read(I2C_CH2, &tmlt_err); // returns a signed Q8.7 format
    if (!tmlt_err)
    {	// filter if I2C-sensor has been read successfully
        slope_limiter(temp_slope_87, tmlt_old_87, &tmp);
        tmlt_temp_87 = (int16_t)(moving_average(&tmlt_ma, (float)tmp) + 0.5);
    } // else
} // tmlt_task()

