Emile666/Brew_HW_Stm8s207/brew_stm8s207.c
/*--------------------------------------------------------------------
  Purpose  : This is the task that processes the temperatures from
             the HLT One-Wire sensor. The sensor has its
             own DS2482 I2C-to-One-Wire bridge. Since this sensor has 4
             fractional bits (1/2, 1/4, 1/8, 1/16), a signed Q8.4 format
             would be sufficient. However all variables are stored in a
             Q8.7 format for accuracy reasons when filtering. All variables
             with this format have the extension _87.
             This task is called every second so that every 2 seconds a new
             temperature is present.
  Variables: thlt_ow_87 : HLT temperature read from sensor in Q8.7 format
	     thlt_ow_err: 1=error
  Returns  : -
  --------------------------------------------------------------------*/
void owh_task(void)
{
    static int owh_std = 0; // internal state
    int16_t    tmp;         // temporary variable (signed Q8.7 format)
    
    switch (owh_std)
    {   
    case 0: // Start Conversion
        ds18b20_start_conversion(I2C_CH0, DS2482_THLT_BASE);
        owh_std = 1;
        break;
    case 1: // Read Thlt_ow device
        thlt_ow_old_87 = thlt_ow_87; // copy previous value of thlt_ow
        tmp = ds18b20_read(I2C_CH0, DS2482_THLT_BASE, &thlt_ow_err,1);
        if (!thlt_ow_err)
        {
            slope_limiter(temp_slope_87, thlt_ow_old_87, &tmp);
            thlt_ow_87 = (int16_t)(moving_average(&thlt_ow_ma, (float)tmp) + 0.5);
        } // if
        owh_std = 0;
        break;
    } // switch
    BG_LEDb = !BG_LEDb; // alive-led for background-processes
} // owh_task()

/*--------------------------------------------------------------------
  Purpose  : This is the task that processes the temperatures from
             the MLT One-Wire sensor. The sensor has its
             own DS2482 I2C-to-One-Wire bridge. Since this sensor has 4
             fractional bits (1/2, 1/4, 1/8, 1/16), a signed Q8.4 format
             would be sufficient. However all variables are stored in a
             Q8.7 format for accuracy reasons when filtering. All variables
             with this format have the extension _87.
             This task is called every second so that every 2 seconds a new
             temperature is present.
  Variables: tmlt_ow_87 : MLT temperature read from sensor in Q8.7 format
	     tmlt_ow_err: 1=error
  Returns  : -
  --------------------------------------------------------------------*/
void owm_task(void)
{
    static int owm_std = 0; // internal state
    int16_t    tmp;         // temporary variable (signed Q8.7 format)
    
    switch (owm_std)
    {   
    case 0: // Start conversion
        ds18b20_start_conversion(I2C_CH0, DS2482_TMLT_BASE);
        owm_std = 1;
        break;
    case 1: // Read Tmlt_ow device
        tmlt_ow_old_87 = tmlt_ow_87; // copy previous value of tmlt_ow
        tmp = ds18b20_read(I2C_CH0, DS2482_TMLT_BASE, &tmlt_ow_err,1);
        if (!tmlt_ow_err)
        {
            slope_limiter(temp_slope_87, tmlt_ow_old_87, &tmp);
            tmlt_ow_87 = (int16_t)(moving_average(&tmlt_ow_ma, (float)tmp) + 0.5);
        } // if
        owm_std = 0;
        break;
    } // switch
} // owm_task()

/*--------------------------------------------------------------------
  Purpose  : This is the task that processes the temperatures from
             the Boil-kettle One-Wire sensor. The sensor has its
             own DS2482 I2C-to-One-Wire bridge. Since this sensor has 4
             fractional bits (1/2, 1/4, 1/8, 1/16), a signed Q8.4 format
             would be sufficient. However all variables are stored in a
             Q8.7 format for accuracy reasons when filtering. All variables
             with this format have the extension _87.
             This task is called every second so that every 2 seconds a new
             temperature is present.
  Variables: tboil_temp_87 : Boil-kettle temperature read from sensor in Q8.7 format
	     tboil_err     : 1=error
  Returns  : -
  --------------------------------------------------------------------*/
void owb_task(void)
{
    static int owb_std = 0; // internal state
    int16_t    tmp;         // temporary variable (signed Q8.7 format)
    
    switch (owb_std)
    {   
    case 0: // Start conversion
        ds18b20_start_conversion(I2C_CH0, DS2482_TBOIL_BASE);
        owb_std = 1;
        break;
    case 1: // Read Tboil device
        tboil_old_87 = tboil_temp_87; // copy previous value of tboil_temp
        tmp = ds18b20_read(I2C_CH0, DS2482_TBOIL_BASE, &tboil_err,1);
        if (!tboil_err)
        {
            slope_limiter(temp_slope_87, tboil_old_87, &tmp);
            tboil_temp_87 = (int16_t)(moving_average(&tboil_ma, (float)tmp) + 0.5);
        } // if
        owb_std = 0;
        break;
    } // switch
} // owb_task()

/*--------------------------------------------------------------------
  Purpose  : This is the task that processes the temperatures from
             the Counterflow Chiller (CFC) One-Wire sensor. The sensor has
             its own DS2482 I2C-to-One-Wire bridge. Since this sensor has 4
             fractional bits (1/2, 1/4, 1/8, 1/16), a signed Q8.4 format
             would be sufficient. However all variables are stored in a
             Q8.7 format for accuracy reasons when filtering. All variables
             with this format have the extension _87.
             This task is called every second so that every 2 seconds a new
             temperature is present.
  Variables: tcfc_temp_87 : CFC temperature read from sensor in Q8.7 format
	     tcfc_err     : 1=error
  Returns  : -
  --------------------------------------------------------------------*/
void owc_task(void)
{
    static int owc_std = 0; // internal state
    int16_t    tmp;         // temporary variable (signed Q8.7 format)
    
    switch (owc_std)
    {   
    case 0: // Start conversion
        ds18b20_start_conversion(I2C_CH0, DS2482_TCFC_BASE);
        owc_std = 1;
        break;
    case 1: // Read Tcfc device
        tcfc_old_87 = tcfc_temp_87; // copy previous value of tcfc_temp
        tmp = ds18b20_read(I2C_CH0, DS2482_TCFC_BASE, &tcfc_err,1);
        if (!tcfc_err)
        {
            slope_limiter(temp_slope_87, tcfc_old_87, &tmp);
            tcfc_temp_87 = (int16_t)(moving_average(&tcfc_ma, (float)tmp) + 0.5);
        } // if
        owc_std = 0;
        break;
    } // switch
} // owc_task()

