Emile666/Brew_HW_Stm8s207/brew_stm8s207.c
/*------------------------------------------------------------------
  Purpose  : This function prints a welcome message to the serial
             port together with the current CVS revision number.
  Variables: 
        ver: string with version info
  Returns  : -
  ------------------------------------------------------------------*/
void print_ebrew_revision(char *ver)
{
    uint8_t len;
    char s[20];
    
    strcpy(ver, "E-Brew V3.0 rev.");  // welcome message, assure that all is well!
    len = strlen(ebrew_revision) - 13;  // just get the rev. number
    strncpy(s,&ebrew_revision[11],len); // example: " 1.3"
    s[len]   = '\n';
    s[len+1] = '\0';
    strcat(ver,s);
} // print_ebrew_revision()

/*------------------------------------------------------------------
  Purpose  : This function prints the IP address to the serial port.
  Variables: The IP-address to print
  Returns  : -
  ------------------------------------------------------------------*/
void print_IP_address(uint8_t *ip)
{
    char s[30];
    uint8_t i;
    
    for (i = 0; i < 4; i++)
    {
        sprintf(s,"%d",ip[i]);
        uart_printf(s);
        if (i < 3) uart_printf(".");
    } // for
} // print_IP_address()

/*-----------------------------------------------------------------------
  Purpose  : This function inits the WIZ550i Ethernet module by
             calling w5500_init() and spi_init(). If a valid MAC address
	     is detected, dhcp_begin() is started.
  Variables: The IP-address to print
  Returns  : 1: success, 0: WIZ550IO not present
  -----------------------------------------------------------------------*/
uint8_t init_WIZ550IO_module(void)
{
    char     s[30];   // Needed for uart_printf() and sprintf()
    uint8_t  bufr[8]; // Needed for w5500_read_common_register()
    uint8_t  ret,x;
    uint16_t y;
    
    //---------------------------------------------------------------
    // Reset WIZ550IO Ethernet module
    //---------------------------------------------------------------
    SPI_NRESETb = 0;           // Hardware reset for WIZ550io
    delay_msec(2);             // At least 500 usec according to datasheet
    SPI_NRESETb = 1;           // Disable hardware reset for WIZ550io
    delay_msec(300);           // Giver W5500 time to configure itself (at least 150 msec)

    ret = Ethernet_begin();    // includes w5500_init() & dhcp_begin()
    if (ret == 0)              // Error, no WIZ550IO module found
    {
        ethernet_WIZ550i = false; // No ETH mode, switch back to USB
        return 0;
    } // if	
    
    x = udp_begin(EBREW_PORT_NR);           // init. UDP protocol
    y = w5500_read_common_register(VERSIONR,bufr);
    sprintf(s,"Version: 0x%02x\n",y);          uart_printf(s);
    sprintf(s,"udp_begin():%s, sock=%d\n",x ? "ok":"err",_sock);   uart_printf(s);
    x = w5500_read_socket_register(_sock, Sn_MR, bufr);
    sprintf(s,"Sn_MR=%d, ",x);                        uart_printf(s);
    local_port = w5500_read_socket_register(_sock, Sn_PORT, bufr);
    sprintf(s,"Sn_PORT=%d, ",local_port);		  uart_printf(s);
    y = w5500_getTXFreeSize(_sock);
    sprintf(s,"Sn_TXfree=%d, ",y);			  uart_printf(s);
    y = w5500_getRXReceivedSize(_sock);
    sprintf(s,"Sn_RXrecv=%d\n",y);			  uart_printf(s);
    w5500_read_common_register(GAR, bufr);
    uart_printf("Gateway IP : "); print_IP_address(bufr);
    w5500_read_common_register(SUBR, bufr);
    uart_printf("\nSubnet Mask: "); print_IP_address(bufr);	
    w5500_read_common_register(SIPR, bufr);
    uart_printf("\nLocal IP   : "); print_IP_address(bufr);
    for (x = 0; x < 4; x++) local_ip[x] = bufr[x]; // copy IP address
    sprintf(s,":%d\n",local_port); // add local port as read back from wiz550io module
    uart_printf(s);
    return 1; // success
} // init_WIZ550IO_module()

/*------------------------------------------------------------------
  Purpose  : This is the main() function for the E-brew hardware.
  Variables: -
  Returns  : should never return
  ------------------------------------------------------------------*/
int main(void)
{
    char    s[25];     // Needed for uart_printf() and sprintf()
    int	    udp_packet_size;
    uint8_t clk;       // which clock is active
    
    __disable_interrupt();
    //-------------------------------------------------------------------
    // For 24 MHz, set ST-LINK->Option Bytes...->Flash_Wait_states to 1 !
    //-------------------------------------------------------------------
    clk = initialise_system_clock(HSE); // Set system-clock to 24 MHz

    uart_init(clk);           // UART init. to BAUDRATE (uart.h),8,N,1
    setup_timers(clk);        // Set Timer 2 to 1 kHz and timer1 and timer3 for PWM output
    setup_gpio_ports();       // Init. needed output-ports for LED and keys
    i2c_init_bb(I2C_CH0);     // Init. I2C bus 0 for bit-banging
    i2c_init_bb(I2C_CH1);     // Init. I2C bus 1 for bit-banging
    i2c_init_bb(I2C_CH2);     // Init. I2C bus 2 for bit-banging
    //pwm_write(PWM_BK ,0);      // Start with 0 % duty-cycle for Boil-kettle
    //pwm_write(PWM_HLT,0);      // Start with 0 % duty-cycle for HLT
    spi_init();               // Init. SPI module: 3 MHz clock, Master mode, SPI mode 1
    max7219_init();           // Init. MAX7219 on SPI-bus
    
    check_and_init_eeprom();  // EEPROM init.
    read_eeprom_parameters(); // Read EEPROM value for ETHUSB and delayed-start
	
    //---------------------------------------------------------------
    // Init. Moving Average Filters for Measurements
    //---------------------------------------------------------------
    init_moving_average(&lm35_ma   ,MAX_MA, (float)INIT_TEMP * 100.0); // Init. MA-filter with 20 °C
    init_moving_average(&thlt_ma   ,MAX_MA, (float)INIT_TEMP * 128.0); // Init. MA-filter with 20 °C
    init_moving_average(&tmlt_ma   ,MAX_MA, (float)INIT_TEMP * 128.0); // Init. MA-filter with 20 °C
    init_moving_average(&tcfc_ma   ,MAX_MA, (float)INIT_TEMP * 128.0); // Init. MA-filter with 20 °C
    init_moving_average(&tboil_ma  ,MAX_MA, (float)INIT_TEMP * 128.0); // Init. MA-filter with 20 °C
    init_moving_average(&thlt_ow_ma,MAX_MA, (float)INIT_TEMP * 128.0); // Init. MA-filter with 20 °C
    init_moving_average(&tmlt_ow_ma,MAX_MA, (float)INIT_TEMP * 128.0); // Init. MA-filter with 20 °C
    lm35_temp     = INIT_TEMP * 100;
    thlt_temp_87  = INIT_TEMP << 7;
    tmlt_temp_87  = INIT_TEMP << 7;
    tcfc_temp_87  = INIT_TEMP << 7;
    tboil_temp_87 = INIT_TEMP << 7;
    thlt_ow_87    = INIT_TEMP << 7;
    tmlt_ow_87    = INIT_TEMP << 7;

    //----------------------------------------------------------------------------
    // Initialize Electric Heating Elements
    // HLT1 and BK1 are on the same 230 V outlet, same for HLT2/BK2 and HLT3/BK3.
    //----------------------------------------------------------------------------
    init_pwm_time(&pwmhlt1,HTR_HLT1,ON1ST);  // HLT Electric heating element 1
    init_pwm_time(&pwmhlt2,HTR_HLT2,OFF1ST); // HLT Electric heating element 2
    init_pwm_time(&pwmhlt3,HTR_HLT3,ON1ST);  // HLT Electric heating element 3
    init_pwm_time(&pwmbk1 ,HTR_BK1 ,OFF1ST); // BK  Electric heating element 1
    init_pwm_time(&pwmbk2 ,HTR_BK2 ,ON1ST);  // BK  Electric heating element 2
    init_pwm_time(&pwmbk3 ,HTR_BK3 ,OFF1ST); // BK  Electric heating element 3

    //---------------------------------------------
    // Initialize all tasks for the Brew Hardware
    //---------------------------------------------
    add_task(pwm_task  ,"pwm_task"  , 10,  100); // Electrical Heating Time-Division every 100 msec.
    add_task(owh_task  ,"owh_task"  ,120, 1000); // Process Temperature from DS18B20 HLT sensor
    add_task(owm_task  ,"owm_task"  ,220, 1000); // Process Temperature from DS18B20 MLT sensor
    add_task(owb_task  ,"owb_task"  ,320, 1000); // Process Temperature from DS18B20 Boil-kettle sensor
    add_task(owc_task  ,"owc_task"  ,420, 1000); // Process Temperature from DS18B20 CFC-output sensor
    add_task(thlt_task ,"thlt_task" ,520, 2000); // Process Temperature from THLT sensor (I2C and/or OW)
    add_task(tmlt_task ,"tmlt_task" ,620, 2000); // Process Temperature from TMLT sensor (I2C and/or OW)
	
    __enable_interrupt();       // set global interrupt enable, start task-scheduler
    uart_printf("\n");
    print_ebrew_revision(s);    // print revision number
    uart_printf(s);		// Output to COM-port for debugging
    if (ethernet_WIZ550i)       // Initialize Ethernet adapter
    {
        if (init_WIZ550IO_module())
        {   // 1 = ok, DHCP-server found
            bz_rpt_max = 1; // Sound buzzer once to indicate ethernet connection ready
            bz_on      = true;
        } // if
    } // if
    sprintf(s,"CLK: 0x%X ",clk);
    uart_printf(s);
    if      (clk == HSI) uart_printf("HSI\n");
    else if (clk == LSI) uart_printf("LSI\n");
    else if (clk == HSE) uart_printf("HSE\n");
    uart_printf("Starting main()\n");

    while(1)
    {
        dispatch_tasks();                // run the task-scheduler
        switch (rs232_command_handler()) // run command handler continuously
        {
            case ERR_CMD: uart_printf("Cmd Err\n"); 
                          break;
            case ERR_NUM: sprintf(s,"Num Err (%s)\n",rs232_inbuf);
                          uart_printf(s);  
                          break;
            default     : break;
        } // switch
        if (ethernet_WIZ550i) // only true after an E1 command
        {
            udp_packet_size = udp_parsePacket();
            if ((udp_packet_size) && (udp_packet_size < UDP_TX_PACKET_MAX_SIZE))
            {
                udp_read(udp_rcv_buf, UDP_TX_PACKET_MAX_SIZE);
                udp_rcv_buf[udp_packet_size] = '\0';
                ethernet_command_handler((char *)udp_rcv_buf);
            } // if	
        } // if
    } // while()
} // main()